src/main/test/supply-chain/0-Validation/0-Apply Tax/5-01_01_06_State_Mandatory/2-TC01_01_06.03_Country_into_exception_list-State_mandatory_and_no_filled/3-TC01.01.06.03_Country_into_exception_list-State_mandatory_and_no_filled-4/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
      <arg0>
            <DocumentId>
		    <SystemSourceId>ICI001</SystemSourceId>
		    <TransactionId/>
		  </DocumentId>
		  <AlternateDocumentId>
		    <CustomField1>CUSTOM_01</CustomField1>
		    <CustomField2/>
		    <CustomField3/>
		    <CustomField4/>
		    <CustomField5/>
		    <CustomField6/>
		    <CustomField7/>
		    <CustomField8/>
		    <CustomField9/>
		    <CustomField10/>
		  </AlternateDocumentId>
		  <InvoiceLanguage>
		    <LanguageCode>en</LanguageCode>
		    <LanguageCountryCode>GB</LanguageCountryCode>
		  </InvoiceLanguage>
		  <CommunicationLanguage>
		    <LanguageCode>en</LanguageCode>
		    <LanguageCountryCode>GB</LanguageCountryCode>
		  </CommunicationLanguage>
		  <CalculationDecimalPlaces/>
		  <PreviousInvoiceTaxCountry/>
		  <TaxDecisionSet>
		    <TaxDecisionSetId/>
		    <SellerTaxIndicator>
		                  <TaxIndicatorAbbreviation>MAT_FZICA</TaxIndicatorAbbreviation>
		                  <TaxIndicatorName>testing purpose</TaxIndicatorName>
		                  <TaxIndicatorComment>testing purpose</TaxIndicatorComment>
		               </SellerTaxIndicator>
		               <SellerTaxCountry>ES</SellerTaxCountry>
		               <SellerTaxState>NULL</SellerTaxState>
		               <BuyerTaxIndicator>
		                  <TaxIndicatorAbbreviation>MAT_FZICA</TaxIndicatorAbbreviation>
		                  <TaxIndicatorName>testing purpose</TaxIndicatorName>
		                  <TaxIndicatorComment>testing purpose</TaxIndicatorComment>
		               </BuyerTaxIndicator>
		               <BuyerTaxCountry>DE</BuyerTaxCountry>
		               <BuyerTaxState>NULL</BuyerTaxState>
		               <CombinedTaxIndicator>NULL</CombinedTaxIndicator>
		               <CommercialIndicator>C</CommercialIndicator>
		               <SellerTaxRegCountry>CN</SellerTaxRegCountry>
		               <SellerTaxRegState>CN50</SellerTaxRegState>
		               <BuyerTaxRegCountry>CA</BuyerTaxRegCountry>
		               <BuyerTaxRegState>CAQC</BuyerTaxRegState>   
		   
		    <TaxComment>
		      <TaxCommentType/>
		      <TaxCommentText/>
		    </TaxComment>
		    <InvoiceCurrency>
		      <CurrencyCode>EUR</CurrencyCode>
		      <SellerLocalTaxCurrencyExchangeRate/>
		      <SellerLocalTaxCurrencyCode/>
		      <BuyerLocalTaxCurrencyExchangeRate/>
		      <BuyerLocalTaxCurrencyCode/>
		    </InvoiceCurrency>
		    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
		    <TaxInvoiceLine>
		      <LineNumber>1</LineNumber>
		      <ItemNo>1</ItemNo>
		      <ItemType/>
		      <UNSPSC>56000000</UNSPSC>
		      <Classification/>
		      <SubClassification/>
		      <CountryItemClassification/>
		      <NetAmount>10.00</NetAmount>
		     
		      <VariableTaxSteeringInput>
		        <ConsignorCountry/>
		        <ConsignorState/>
		        <ConsignorBusinessUnitCode/>
		        <ConsignorBusinessUnitType/>
		        <ConsigneeCountry/>
		        <ConsigneeState/>
		        <ConsigneeBusinessUnitCode/>
		        <ConsigneeBusinessUnitType/>
		        <CarrierCountry/>
		        <CarrierState/>
		        <CarrierBusinessUnitCode/>
		        <CarrierBusinessUnitType/>
		        <ShipmentStartCountry/>
		        <ShipmentEndCountry/>
		        <ShipmentStartState/>
		        <ShipmentEndState/>
		        <ServiceRenderedCountry/>
		        <ServiceRenderedState/>
		        <ResalePurpose/>
		        <IsOutBonded/>
		        <IsInBonded/>
		        <TaxPreAlgorithmOutput>
		          <IsExport/>
		          <IsImport/>
		          <IsExported/>
		          <IsImported/>
		        </TaxPreAlgorithmOutput>
		        <ShippingOfCustomsClearedGoods/>
		      </VariableTaxSteeringInput>
		     
		    </TaxInvoiceLine>
		  </TaxDecisionSet>
		  <TaxDate>
		    <TaxAlgorithmDate>2013-10-28</TaxAlgorithmDate>
		    <TaxCalculationDate/>
		  </TaxDate>
		  <TaxModuleBehaviour>
		    <SkipCalculation>N</SkipCalculation>
		    <SkipDecision>Y</SkipDecision>
		  </TaxModuleBehaviour>
		  <VariableTaxSteeringInput>
		    <ConsignorCountry/>
		    <ConsignorState/>
		    <ConsignorBusinessUnitCode>9000</ConsignorBusinessUnitCode>
		    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
		    <ConsigneeCountry>ES</ConsigneeCountry>
		    <ConsigneeState/>
		    <ConsigneeBusinessUnitCode>7008</ConsigneeBusinessUnitCode>
		    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
		    <CarrierCountry/>
		    <CarrierState/>
		    <CarrierBusinessUnitCode/>
		    <CarrierBusinessUnitType/>
		    <ShipmentStartCountry/>
		    <ShipmentEndCountry/>
		    <ShipmentStartState/>
		    <ShipmentEndState/>
		    <ServiceRenderedCountry/>
		    <ServiceRenderedState/>
		    <ResalePurpose/>
		    <IsOutBonded/>
		    <IsInBonded/>
		    <TaxPreAlgorithmOutput>
		      <IsExport>Y</IsExport>
		      <IsImport>N</IsImport>
		      <IsExported>N</IsExported>
		      <IsImported>N</IsImported>
		    </TaxPreAlgorithmOutput>
		    <ShippingOfCustomsClearedGoods/>
		  </VariableTaxSteeringInput>
		  <BuyerParty>
		    <Party>
		      <BusinessUnitCode>7008</BusinessUnitCode>
		      <BusinessUnitType>COM</BusinessUnitType>
		      <BusinessUnitName>RETAIL CENTERS MANAGEMENT</BusinessUnitName>
		    
		      <PartyAddress>
		        <AddressType/>
		        <City/>
		        <PostBox/>
		        <Street/>
		        <ZipCode/>
		        <CountryCode>ES</CountryCode>
		        <StateCode/>
		        <CountryOfLegalRegistration/>
		      </PartyAddress>
		    </Party>
		    
		  </BuyerParty>
		  <SellerParty>
		    <Party>
		      <BusinessUnitCode>9000</BusinessUnitCode>
		      <BusinessUnitType>COM</BusinessUnitType>
		      <BusinessUnitName>IKEA STIFTUNG</BusinessUnitName>
		      
		      <PartyAddress>
		        <AddressType/>
		        <City/>
		        <PostBox/>
		        <Street/>
		        <ZipCode/>
		        <CountryCode>DE</CountryCode>
		        <StateCode/>
		        <CountryOfLegalRegistration/>
		      </PartyAddress>
		    </Party>
		   
		  </SellerParty>
		  <TermOfDelivery>TD-DDU</TermOfDelivery>
		  <Error>
		    <ErrorCode/>
		    <ErrorType/>
		    <ErrorText/>
		  </Error>
         </arg0>
         </ws:applyTax>
   </soap:Body>
</soap:Envelope>